Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འདུས་པ་ལན་གྲངས་མཐའ་ཡས་ཀུན་ལ་ཡང་། །ཕྱིར་མི་ལྡོག་པ་ཐམས་ཅད་གཟུངས་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བརྒྱ་བརྒྱ་ཡོད། །
en: “There will be infinitely many congregations, Each of them gathering ten trillion Irreversible ones who all have accomplished retention.

source: མི་ཚེ་ལོ་གྲངས་བྱེ་བ་ཕྲག་སྟོང་ཡིན། །
en: The lifespan of humans will be ten billion years,

source: བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བར་གནས་པར་འགྱུར། །
en: “And in order to ripen beings for awakening The sacred Dharma will remain for ten million years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །རིན་ཆེན་མེ་ཏོག་སྟོང་སྙེད་དག་གིས་བརྒྱན། །
en: The relics of this victor will be abundant And adorned with thousands of jewels and flowers.

source: དེ་བཞིན་གཤེགས་པ་མདངས་མངའ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་སྡུག་པར་རྣམ་པར་ལྟ་ཞེས་བྱ། །
en: “The thus-gone Ojodhārin Will be born in a place called Delightful View

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཡབ་ནི་འབྱོར་ལྡན་ཡིན། །ཡེ་ཤེས་ཅན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ten million leagues. “Endowed with Wealth will be his father, and Endowed with Wisdom will be this victor’s mother.

source: སྲས་པོ་རྣམ་གྲོལ་ཆགས་མེད་རིམ་གྲོ་པ། །
en: Liberated will be his son and Free from Attachment his attendant.

source: འབྲུག་སྒྲ་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Sound of Thunder will be the scholar

source: མདངས་སྟོབས་འགྲོས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Mode of Lucid Strength the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐེག་པ་མཆོག་གིས་བྱང་ཆུབ་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred ninety million Who attain awakening by means of the supreme vehicle.

source: བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་སུམ་ཁྲིར་གནས་པར་འགྱུར། །
en: “And in order to ripen beings for awakening The sacred Dharma will remain for thirty thousand years.

source: མཆོད་རྟེན་དཔག་ཚད་བཅུ་གཉིས་པ་འབྱུང་སྟེ། །རིན་ཆེན་ཐེར་འབུམ་སྙེད་ཀྱིས་སྤྲས་པར་འགྱུར། །
en: There will appear a stūpa of twelve leagues Studded with a billion jewels.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་དགྱེས་པ་ཡི། །སྐྱེ་ཡུལ་བསོད་ནམས་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Puṇyapriya Will be born in a place called Illuminating Merit.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །སྟོང་གསུམ་ཙམ་ཡོད་ཡབ་ནི་འོད་ལྡན་ཡིན། །བདུད་རྩིའི་འོད་ནི་རྒྱལ་ཡུམ་རྩི་སྨན་ནི། །སྲས་ཡིན་སྨན་པ་བཟང་པོ་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend as far as a trichiliocosm. “Radiant will be his father, and Nectar Light will be this victor’s mother. Medicine will be his son and Excellent Medicine his attendant.

source: རྣམ་པར་བརྩེ་བའི་བློ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Loving Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །གཟུངས་ཐོབ་བྱང་ཆུབ་དག་ལ་རབ་གནས་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་དགུ་དགུ་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering nine hundred billion Who have attained retention and are supported by awakening.

source: མི་ཚེ་ལོ་གྲངས་དྲུག་འབུམ་སུམ་ཁྲི་ཡིན། །
en: The lifespan of humans will be six hundred thirty thousand years,

source: བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་དྲུག་འབུམ་སུམ་ཁྲིར་གནས། །
en: “And in order to ripen beings for awakening The sacred Dharma will also remain for six hundred thirty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །གསེར་གྱི་རྒྱལ་མཚན་མཆོག་སྟོང་སྙེད་ཀྱིས་བརྒྱན། །
en: The relics of this victor will be abundant And adorned with thousands of golden banners.

source: དེ་བཞིན་གཤེགས་པ་དགའ་བའི་སྟོབས་སྐྱེ་བའི། །ཡུལ་ནི་མཆོད་པས་ཀུན་དུ་ཚིམ་ཞེས་བྱ། །
en: “The thus-gone Ratibala Will be born in a place called Satisfying Offerings.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཏུ་མེད་དོ་ཡབ་ནི་ཡིད་འཐད་ཡིན། །ཕན་པར་སེམས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will have immeasurable reach. “Reasoning Mind will be his father, and Benevolent Mind will be this victor’s mother.

source: སྲས་པོ་ཕན་འདོད་ཟླ་བ་རིམ་གྲོ་པ། །
en: Wish to Benefit will be his son and Moon his attendant.

source: བློ་གྲོས་ཡངས་པ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Vast Intelligence will be the scholar

source: ཕྱིར་མི་ལྡོག་པ་གཟུངས་ནི་ཐོབ་པ་པོ། །འཇམ་པའི་དཔལ་དང་མཚུངས་པ་དེ་དག་ཀུན། །འདུས་པ་དག་ནི་ཤིན་ཏུ་མཐའ་ཡང་ཡས། །
en: “Irreversible ones who have attained retention And are the equals of Mañjuśrī Will gather in infinite congregations.

source: མི་ཚེ་ལོ་གྲངས་སུམ་འབུམ་ཉི་ཁྲི་ཡིན། །
en: The lifespan of humans will be three hundred twenty thousand years,

source: ཐེག་པ་མཆོག་ལྡན་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ཆིག་འབུམ་ཉི་ཁྲིར་གནས་པར་འགྱུར། །
en: “And in order to ripen beings for possession of the supreme vehicle The sacred Dharma will, upon the teacher’s parinirvāṇa, Remain for one hundred twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: The relics of this victor will be abundant.

source: མཚུངས་པ་མེད་པ་དབྱངས་དག་སྙན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འོད་ཀྱི་མཆོག་ཅེས་བྱ། །
en: “The incomparable Sughoṣa Will be born in a place called Supreme Light.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་ཡབ་ནི་དགེ་བཟང་ཡིན། །འཇིགས་པ་མེད་པའི་འོད་ནི་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend one thousand leagues. “Excellent Virtue will be his father and Light of Fearlessness will be this victor’s mother.

source: སྲས་པོ་ཤེས་རབ་ཤེས་ཆེན་རིམ་གྲོ་པ། །
en: Insight will be his son and Great Knowledge his attendant.

source: ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Crest Banner will be the scholar

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་དག་བཅོམ་པ་དེ་དག་འདུས་པའི་གྲངས། །འབུམ་ཕྲག་བདུན་ཅུ་རྩ་ནི་གསུམ་གསུམ་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering seven million three hundred thousand Worthy ones who have gathered virtue.

source: དངོས་པོ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one gone beyond entities Will remain for seventy-three thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་གསུམ་པ་གཅིག་མུ་ཏིག་བླ་རེར་ལྡན། །
en: The stūpa with the relics of this victor Will be thirteen leagues large and adorned with canopies of pearl.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབང་ཕྱུག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཐར་པའི་སྒྲ་ཞེས་བྱ། །
en: “The thus-gone Dharmeśvara Will be born in a place called Sound of Liberation.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །སྟོང་གཉིས་ཙམ་ཡོད་དབང་པོ་ཆེན་པོ་ཡབ། །ཡོན་ཏན་ཚོགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend two thousand leagues. “Great Ruler will be his father, and Gathering of Qualities will be this victor’s mother.

source: སྲས་པོ་ལེགས་མཐོང་དགེ་བ་རིམ་གྲོ་པ། །
en: Excellent Sight will be his son and Virtue his attendant.

source: བདུད་རྩིའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Nectar Light will be the scholar

source: འབྱོར་བའི་སྒྲོན་མ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Wealth Lamp the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །བྱང་ཆུབ་ཏུ་ནི་སྐྱེ་བ་གཅིག་ཐོགས་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བརྒྱ་བརྒྱ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering ten trillion Who are a single life away from awakening.

source: བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་དུང་ཕྱུར་ཕྲག་དྲུག་གནས། །
en: “And in order to ripen beings for awakening The sacred Dharma will remain for six million years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་གཅིག་པ་གཅིག་གསེར་གྱི་འོད་དང་ལྡན། །
en: The relics of this victor will reside in a stūpa Eleven leagues large and shining with golden light.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་སྒྲ་དབྱངས་འོད་ཅེས་བྱ། །
en: “The thus-gone Brahmaruta Will be born in a place called Melody and Light.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་མཐུ་ལྡན་ཡིན། །རིན་ཆེན་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend one hundred leagues. “Powerful will be his father, and Jewel Light will be this victor’s mother.

source: སྲས་པོ་རྒྱལ་མཆོག་སྐར་མཁན་རིམ་གྲོ་པ། །
en: Supreme Victor will be his son and Astrologer his attendant.

source: སེང་གེའི་འགྲོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Lion Mode will be the scholar

source: བསོད་ནམས་འཁོར་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Merit Circle the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཉིས་ཀུན་ལ་ཡང་། །འཕགས་པ་མཆོག་གནས་ངེས་པར་གྱུར་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be twelve consecutive congregations, Each of them gathering seven hundred forty million Noble ones who have attained deliverance in the supreme abode.

source: འཇིག་རྟེན་ཕན་ཕྱིར་སྲིད་མཐར་མཛད་པ་པོ། །ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this teacher who brings an end to existence has attained parinirvāṇa His sacred Dharma will, for the benefit of the world, Remain for sixty thousand years.

source: སེམས་ཅན་སྙིང་པོ་སྤྱོད་པ་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་རྟེན་བཟང་ཞེས་བྱ། །
en: “The heart of sentient beings, Suceṣṭa, Will be born in a place called Excellent Stūpa.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་བརྒྱ་ཡབ་ནི་ཟླ་འོད་ཡིན། །གཟི་བརྗིད་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend five hundred leagues. “Moonlight will be his father, and Splendid Light will be this victor’s mother.

source: སྲས་པོ་ངེས་པ་གྱ་ནོམ་རིམ་གྲོ་པ། །
en: Certainty will be his son and Perfection his attendant.

source: མིག་སྡུག་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Beautiful Eye will be the scholar

source: ཤིན་ཏུ་དུལ་བར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Observance of Tremendous Discipline the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །བཟོད་པ་དུལ་གནས་ཞི་གནས་མཆོག་ཐོབ་པ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be thirty consecutive congregations, Each of them gathering one billion Who are patient and highly disciplined and have attained supreme calm abiding.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་གནས། །
en: The lifespan of humans will be thirty-six thousand years,

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ཏེ། །ཞིང་རྣམས་ཀུན་ཏུ་རྣམ་པར་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, Filling all of the realms.

source: དེ་བཞིན་གཤེགས་པ་འཁྲུལ་པ་མེད་པའི་བློ། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་འོད་ཅེས་བྱ། །
en: “The thus-gone Askhalita­buddhi Will be born in a place called Light of the World.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །སྟོང་གསུམ་ཙམ་ཡོད་ཡབ་ནི་དྲན་ལྡན་ཡིན། །ཚོགས་ཅན་གཙོ་རྒྱལ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend as far as the trichiliocosm. “Endowed with Mindfulness will be his father, and Royal Leader Endowed with the Gathering will be this victor’s mother.

source: ཐར་པ་རྣམ་འཕྲུལ་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Miraculous Display of Liberation the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐེག་པ་མཆོག་གིས་བྱང་ཆུབ་ངེས་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred twenty million Who are certain to attain awakening by means of the supreme vehicle.

source: བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: “And in order to ripen beings for awakening The sacred Dharma will remain for eighty thousand years.

source: དཔག་ཚད་བདུན་པ་བཀོད་པ་མཛེས་པར་བྱས། །
en: Seven leagues large and decorated with beautiful arrays.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་ནི་ཆེན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡིས་བསྒྲགས་ཞེས་བྱ། །
en: “The thus-gone Mahāpraṇāda Will be born in a place called Famed by Gods.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་གཉིས་ཡབ་ནི་མེ་ཏོག་བཟང་། །གྲགས་པའི་སྟོབས་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཡོན་ཏན་དགའ་ཡིན་རྫོགས་ལྡན་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend ninety-two leagues. “Excellent Flower will be his father, and Famed Strength will be this victor’s mother. Qualities of Joy will be his son and Endowed with Perfection his attendant.

source: ཚངས་པའི་དབྱངས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Brahmā Melody will be the scholar

source: ཤེས་རབ་ལེགས་སེམས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Insight and Excellent Attention the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །ང་མེད་དགྲ་བཅོམ་འཁྲུལ་པ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་ལྔ་ལྔ་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering two hundred fifty million Worthy ones for whom there is no ‘I’ and are free from delusion.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: “And after this teacher has attained parinirvāṇa His sacred Dharma will remain for twenty-three thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་རིན་ཆེན་སྣ་བདུན་དག་གིས་སྤྲས། །
en: The relics of this victor will be abundant, And the stūpas will be adorned with the seven precious substances.

source: དེ་བཞིན་གཤེགས་པ་སྙན་པར་གྲགས་པ་ཡི། །སྐྱེ་ཡུལ་འཇིག་རྟེན་ཡོན་ཏན་དགའ་ཞེས་བྱ། །
en: “The thus-gone Yaśaḥkīrti Will be born in a place called World of Joyous Qualities.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གསུམ་ཡབ་ནི་ཕན་འདོད་ཡིན། །བྱང་ཆུབ་འདོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend thirty-three leagues. “Wish to Benefit will be his father, and Wish for Awakening will be this victor’s mother.

source: སྲས་པོ་རྨ་མེད་སྒྲ་སྒྲོགས་རིམ་གྲོ་པ། །
en: Irreproachable will be his son and Proclaimer his attendant.

source: བདུད་རྩིའི་བློ་གྲོས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Nectar Intelligence will be the scholar

source: ཆགས་པ་མེད་པའི་སྒྲོན་མ་རྫུ་འཕྲུལ་ཅན། །
en: And Lamp of Freedom from Attachment the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །བདུད་དང་སྲིད་པའི་དྲ་བ་འཇོམས་པ་པོ། །འབུམ་ཕྲག་སུམ་ཅུ་རྩ་ནི་བཞི་བཞི་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering three million four hundred thousand Who vanquish the māras and the web of existence.

source: དངོས་པོ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has gone beyond entities His sacred Dharma will remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་དགུ་པ་ལེགས་པར་རྣམ་པར་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Nine leagues large and beautifully decorated.

source: འཇིག་རྟེན་མགོན་པོ་ཏོག་ལྡན་སྐྱེ་བའི་ཡུལ། །འོད་འཕྲོ་སྣང་བར་བྱེད་པ་ཞེས་ཀྱང་བྱ། །
en: “The protector of the world, Ketumat, Will be born in a place called Illuminating Radiance.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ལྷ་དབང་ཡིན། །ཐར་པའི་དབྱངས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend nine leagues. “Divine Ruler will be his father, and Melody of Liberation will be this victor’s mother.

source: སྲས་པོ་ཟླ་མཆོག་སེམས་དཔའ་རིམ་གྲོ་པ། །
en: Supreme Moon will be his son and Heroic Mind his attendant.

source: མེ་ཏོག་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Flower Light will be the scholar

source: རྫུ་འཕྲུལ་སྤོབས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Miraculous Acumen the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་དྲུག་ཀུན་ལའང་། །འཇིག་རྟེན་ཆོས་ཀྱིས་གོས་པ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བདུན་བདུན་ཡོད། །
en: “There will be twenty-six consecutive congregations, Each of them gathering seven hundred seventy million Who are free from the stains of the world.

source: རབ་ཏུ་ཞི་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has gone to supreme peace His sacred Dharma will remain for twenty-six thousand years.

source: མཆོད་རྟེན་ཁྲི་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་འབྱུང་། །རྒྱལ་མཚན་བྱེ་བ་སྟོང་གིས་མཛེས་པར་བྱས། །
en: There will be nine hundred sixty thousand stūpas Adorned with billions of banners.

source: རྒྱལ་བ་གཟི་བརྗིད་རྣམ་པར་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཐར་པའི་དབྱངས་ཞེས་བྱ། །
en: “The victorious Vighuṣṭatejas Will be born in a place called Melody of Liberation.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་འབྱོར་པའི་ཡོན་ཏན་ཡབ། །རྒྱུ་སྐར་བདག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ten million leagues. “Qualities of Wealth will be his father, and Star Owner will be this victor’s mother.

source: སྲས་པོ་མེ་ཏོག་བཟོད་པ་རིམ་གྲོ་པ། །
en: Flower will be his son and Patience his attendant.

source: ཡོན་ཏན་སྒྲོགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Proclaimer of Qualities will be the scholar

source: བདེན་པར་སྨྲ་བའི་ང་རོ་རྫུ་འཕྲུལ་ཅན། །
en: And Roar of the Teaching of Truth the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །བདུད་དང་ཉོན་མོངས་ཐམས་ཅད་འཇོམས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་དགུ་དགུ་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering ninety hundred billion Who conquer all māras and defilements.

source: མི་ཚེ་ལོ་གྲངས་དྲུག་ཁྲི་བདུན་སྟོང་ཡིན། །
en: The lifespan of humans will be sixty-seven thousand years,

source: རྣམ་པར་གྲོལ་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has perfected liberation His sacred Dharma will remain for thirty-two thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བརྒྱ་པ་གཅིག །རིན་ཆེན་བརྒྱ་ཡི་དྲ་བས་རྣམ་པར་སྤྲས། །
en: His relics will reside in a single stūpa of one hundred leagues That is adorned with nets of hundreds of jewels.

source: སངས་རྒྱས་འགྲོ་བའི་དབང་ཕྱུག་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཐར་པ་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The buddha Jagadīśvara Will be born in a place called Illuminating Liberation.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་བརྒྱ་ཤིན་ཏུ་འཇིགས་བྱེད་ཡབ། །ལྷ་ཡི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend eight hundred leagues. “Terrifying will be his father, and Divine Light will be this victor’s mother.

source: སྲས་པོ་གྲོགས་བྱེད་མཐུ་རྩལ་རིམ་གྲོ་པ། །
en: Helper will be his son and Power his attendant.

source: ཡིད་འོང་གཟི་བརྗིད་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Delightful Splendor will be the one of intelligence

source: ཆགས་བྲལ་གཏི་མུག་མེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Free from Attachment and Dullness the one of miracles.

source: འདུས་པ་ལན་གྲངས་ལྔ་སྟེ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་རིམས་ནད་མེད་པར་གྱུར་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བརྒྱ་བརྒྱ་ཡོད། །
en: “There will be five consecutive congregations, Each of them gathering ten trillion Worthy ones who are free from the plagues.

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དྲུག་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has perfected exhaustion His sacred Dharma will also remain for sixty-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །མུ་ཏིག་སྟོང་ལྡན་རྒྱལ་མཚན་དག་གིས་བསྐོར། །
en: The relics of this victor will be abundant, Adorned with thousands of jewels and encircled by banners.

source: འཇིག་རྟེན་མགོན་པོ་ལྗོན་པ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཐར་པར་དད་པར་བྱེད་ཅེས་བྱ། །
en: “The protector of the world, Druma, Will be born in a place called Instilling Faith in Liberation.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དགུ་བཅུ་རྩ་དགུ་ཡབ་ནི་སྤོས་བཟང་ཡིན། །དབང་པོ་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend ninety-nine leagues. “Excellent Fragrance will be his father, and Ruling Light will be this victor’s mother.

source: སྲས་པོ་བདེ་དགའ་དྲག་ཤུལ་རིམ་གྲོ་པ། །
en: Happy Joy will be his son and Fierce his attendant.

source: ལྷ་གྲགས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Divine Fame will be the scholar

source: བླ་ན་མེད་པར་སེམས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Unsurpassable Intention the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །ལྷ་ཡི་གནས་ཀྱི་ཕ་མཐར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering three hundred fifty million Worthy ones who have gone beyond the divine abodes.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བཞི་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has gone to cessation His sacred Dharma will remain for four thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་དགུ་པ་གཅིག །རྒྱལ་མཚན་མཆོག་དང་གཙུག་གི་ནོར་བུས་བརྒྱན། །
en: His relics will reside in a single stūpa Nine leagues large and adorned with supreme banners and crown jewels.

source: རྒྱལ་བ་གཏི་མུག་རབ་ཟད་སྐྱེ་བ་ཡི། །ཡུལ་ནི་མཁས་པར་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The victorious Supraṇaṣṭamoha Will be born in a place called Skillful Illumination.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་ཡབ་ནི་ཁྱད་པར་འཕགས། །གཟི་ལྡན་དགའ་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཤིང་རྟ་དགའ་ཡིན་སྤྲིན་ལྡན་རིམ་གྲོ་པ། །
en: The family of this victor will be kṣatriya, And his light will extend one thousand leagues. “Distinguished will be his father, and Splendid Joy will be this victor’s mother. Chariot of Joy will be his son and Cloud Bearer his attendant.

source: ཏོག་གི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Shining Crest will be the scholar

source: སྒྲ་མཆོག་ཅེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Sound the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་གསུམ་ཀུན་ལའང་། །ང་རྒྱལ་རྒྱལ་མཚན་ཆུར་ནི་ལྷུང་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty-three consecutive congregations, Each of them gathering six hundred twenty million Who have sunk the banner of pride in the sea.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་བདུན་སྟོང་ཡིན། །
en: The lifespan of humans will be thirty-seven thousand years,

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག ། ལོ་གྲངས་སུམ་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for thirty-four thousand years.

source: འགྲོ་ལ་ཕན་ཕྱིར་རྒྱལ་བའི་སྐུ་གདུང་དག །རྒྱས་འགྱུར་ཞིང་རྣམས་རྣམ་པར་གང་བར་འགྱུར། །
en: His relics will be abundant, Filling the realms to the benefit of beings.

source: སེམས་ཅན་སྙིང་པོ་དཔག་ཏུ་མེད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མི་ཟད་མཛོད་ཅེས་བྱ། །
en: “The heart of sentient beings, Amita, Will be born in a place called Inexhaustible Treasury.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དུང་ཕྱུར་ཕྲག་བརྒྱད་ཡབ་ནི་ལག་བཟངས་ཡིན། །དག་པའི་འོད་ནི་རྒྱལ་ཡུམ་སྒྲ་གཅན་འཛིན། །སྲས་ནི་ལྷ་ཡི་དབང་པོ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend eight hundred million leagues. “Excellent Hand will be his father, and Pure Light will be this victor’s mother. Rāhula will be his son and Divine Ruler his attendant.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །ཐོས་པའི་མཛོད་ལྡན་རྒྱ་མཚོ་འདྲ་མཚུངས་པ། །དེ་དག་ཐེར་འབུམ་ཐེར་འབུམ་འདུས་པར་འགྱུར། །
en: “There will be sixty consecutive congregations, Each of them gathering one billion Ocean-like possessors of the treasury of learning.

source: རྡུལ་བྲལ་མཆོད་རྟེན་དཔག་ཚད་བརྒྱད་པ་སྟེ། །རིན་ཆེན་བརྒྱ་ཡི་ལྡ་ལྡིས་མཛེས་བྱས་ཤིང་། །ནོར་བུའི་དྲ་བ་དག་གིས་ཀུན་ཏུ་བརྒྱན། །
en: His immaculate stūpa will be eight leagues large, Decorated with tassels of hundreds of jewels, And adorned with precious nets.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཟླ་བའི་འོད་ཅེས་བྱ། །
en: “The thus-gone Sucandra Will be born in a place called Moonlight.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་སྒྲོན་མ་ཡིན། །ལྷ་ཡི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend one hundred leagues. “Lamp will be his father, and Divine Light will be this victor’s mother.

source: སྲས་པོ་ལྷ་ལེགས་བརྟན་པ་རིམ་གྲོ་པ། །
en: Excellent Divinity will be his son and Steadfast his attendant.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་ཡིད་བཞིན་དུ་ནི་རྫོགས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering two hundred twenty million Worthy ones who have fulfilled their wishes.

source: འགྲོ་ལ་ཕན་ཕྱིར་རྒྱལ་བའི་སྐུ་གདུང་དག །རྒྱས་འགྱུར་ཞིང་རྣམས་ཀུན་ཏུ་གང་བར་འགྱུར། །
en: His relics will be abundant, Filling the realms for the benefit of beings.
